In [1]:
import pandas as pd
from pathlib import Path

In [2]:
# Specify custom missing values

path_ = '/home/success/Downloads/Data_ML/data/numpy.csv'

file = pd.read_csv(path_, sep=';', na_values=['NaN', 'Unknown'])

In [3]:
new_index = [f'line_{i}' for i in file.index]

file.index = new_index
# Replace the existing index with the new one

# Display the DataFrame with the updated index
print(file)

               City  Country  Zipcode Population in millions
line_0        Paris      NaN      NaN                  2 161
line_1       London      NaN      NaN                  8 982
line_2       Nevada      NaN      NaN                  3 144
line_3    Marseille      NaN      NaN              0.861 635
line_4     New York      NaN      NaN                  8 468
line_5      Chicago      NaN      NaN                  2 697
line_6  Los angeles      NaN      NaN                  3 849

In [4]:
file

               City  Country  Zipcode Population in millions
line_0        Paris      NaN      NaN                  2 161
line_1       London      NaN      NaN                  8 982
line_2       Nevada      NaN      NaN                  3 144
line_3    Marseille      NaN      NaN              0.861 635
line_4     New York      NaN      NaN                  8 468
line_5      Chicago      NaN      NaN                  2 697
line_6  Los angeles      NaN      NaN                  3 849

In [5]:
file.loc['line_0':'line_6':1, ['City', 'Population in millions']]

               City Population in millions
line_0        Paris                  2 161
line_1       London                  8 982
line_2       Nevada                  3 144
line_3    Marseille              0.861 635
line_4     New York                  8 468
line_5      Chicago                  2 697
line_6  Los angeles                  3 849

In [6]:
file.iloc[1:6:1,:]

             City  Country  Zipcode Population in millions
line_1     London      NaN      NaN                  8 982
line_2     Nevada      NaN      NaN                  3 144
line_3  Marseille      NaN      NaN              0.861 635
line_4   New York      NaN      NaN                  8 468
line_5    Chicago      NaN      NaN                  2 697